### import pandas as pd

In [35]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\vishal\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\vishal\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\vishal\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\vishal\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\vishal\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\vishal\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('titanic.csv')

In [5]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0
...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0

In [6]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.head()

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0

In [15]:
df.tail()

,survived,pclass,name,sex,age,fare,sibsp,parch
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.125,0,5
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.000,0,0
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.000,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.000,0,0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.750,0,0

In [17]:
df.shape

(714, 8)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  714 non-null    int64
 1   pclass    714 non-null    int64
 2   name      714 non-null    object
 3   sex       714 non-null    object
 4   age       714 non-null    float64
 5   fare      714 non-null    float64
 6   sibsp     714 non-null    int64
 7   parch     714 non-null    int64
dtypes: float64(2), int64(4), object(2)
memory usage: 44.8+ KB

In [20]:
df.columns

Index(['survived', 'pclass', 'name', 'sex', 'age', 'fare', 'sibsp', 'parch'], dtype='object')

In [21]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0
...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0

In [22]:
df[['pclass', 'fare']]

     pclass     fare
0         3   7.2500
1         1  71.2833
2         3   7.9250
3         1  53.1000
4         3   8.0500
..      ...      ...
709       3  29.1250
710       2  13.0000
711       1  30.0000
712       1  30.0000
713       3   7.7500

[714 rows x 2 columns]

In [24]:
df['pclass']

0      3
1      1
2      3
3      1
4      3
      ..
709    3
710    2
711    1
712    1
713    3
Name: pclass, Length: 714, dtype: int64

In [25]:
type(df['pclass'])

pandas.core.series.Series

In [26]:
#pandas have two data type one is series and one is dataframe

In [27]:
type(df[['pclass']])

pandas.core.frame.DataFrame

In [28]:
df.columns

Index(['survived', 'pclass', 'name', 'sex', 'age', 'fare', 'sibsp', 'parch'], dtype='object')

In [29]:
type(df.columns)

pandas.core.indexes.base.Index

In [30]:
df[['name','sex','age']]

                                                  name     sex   age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
709               Rice, Mrs. William (Margaret Norton)  female  39.0
710                              Montvila, Rev. Juozas    male  27.0
711                       Graham, Miss. Margaret Edith  female  19.0
712                              Behr, Mr. Karl Howell    male  26.0
713                                Dooley, Mr. Patrick    male  32.0

[714 rows x 3 columns]

In [32]:
df[['name','sex','age']].head(10)

                                                name     sex   age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0
5                            McCarthy, Mr. Timothy J    male  54.0
6                     Palsson, Master. Gosta Leonard    male   2.0
7  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
8                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0
9                    Sandstrom, Miss. Marguerite Rut  female   4.0

In [33]:
# https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv

In [34]:
pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [41]:
df1 = pd.read_excel("sample_data.xlsx", sheet_name = "sudh2")
df1

    ID       Name  Age   City  Salary
0    1   Person_1   21  CityA   30750
1    2   Person_2   22  CityB   31500
2    3   Person_3   23  CityC   32250
3    4   Person_4   24  CityD   33000
4    5   Person_5   25  CityA   33750
5    6   Person_6   26  CityB   34500
6    7   Person_7   27  CityC   35250
7    8   Person_8   28  CityD   36000
8    9   Person_9   29  CityA   36750
9   10  Person_10   20  CityB   37500
10   1   Person_1   21  CityA   30750
11   2   Person_2   22  CityB   31500
12   3   Person_3   23  CityC   32250
13   4   Person_4   24  CityD   33000
14   5   Person_5   25  CityA   33750
15   6   Person_6   26  CityB   34500
16   7   Person_7   27  CityC   35250
17   8   Person_8   28  CityD   36000
18   9   Person_9   29  CityA   36750
19  10  Person_10   20  CityB   37500

In [40]:
df1.shape

(20, 5)

In [42]:
df1.head(0)

Empty DataFrame
Columns: [ID, Name, Age, City, Salary]
Index: []

In [44]:
df1[:]

    ID       Name  Age   City  Salary
0    1   Person_1   21  CityA   30750
1    2   Person_2   22  CityB   31500
2    3   Person_3   23  CityC   32250
3    4   Person_4   24  CityD   33000
4    5   Person_5   25  CityA   33750
5    6   Person_6   26  CityB   34500
6    7   Person_7   27  CityC   35250
7    8   Person_8   28  CityD   36000
8    9   Person_9   29  CityA   36750
9   10  Person_10   20  CityB   37500
10   1   Person_1   21  CityA   30750
11   2   Person_2   22  CityB   31500
12   3   Person_3   23  CityC   32250
13   4   Person_4   24  CityD   33000
14   5   Person_5   25  CityA   33750
15   6   Person_6   26  CityB   34500
16   7   Person_7   27  CityC   35250
17   8   Person_8   28  CityD   36000
18   9   Person_9   29  CityA   36750
19  10  Person_10   20  CityB   37500

In [45]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0
...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0

In [46]:
df['survived'] == 1

0      False
1       True
2       True
3       True
4      False
       ...
709    False
710    False
711     True
712     True
713    False
Name: survived, Length: 714, dtype: bool

In [47]:
df[df['survived'] == 1]

,survived,pclass,name,sex,age,fare,sibsp,parch
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
7,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,11.1333,0,2
8,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,1,0
...,...,...,...,...,...,...,...,...
700,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,7.2250,0,0
703,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,83.1583,0,1
704,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,26.0000,0,1
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0

In [49]:
df[df['age']<=18]

,survived,pclass,name,sex,age,fare,sibsp,parch
6,0,3,"Palsson, Master. Gosta Leonard",male,2.0,21.0750,3,1
8,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,1,0
9,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,16.7000,1,1
13,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,7.8542,0,0
15,0,3,"Rice, Master. Eugene",male,2.0,29.1250,4,1
...,...,...,...,...,...,...,...,...
680,0,3,"Boulos, Miss. Nourelain",female,9.0,15.2458,1,1
681,1,1,"Lines, Miss. Mary Conover",female,16.0,39.4000,0,1
683,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,9.3500,0,1
694,1,3,"Johnson, Master. Harold Theodor",male,4.0,11.1333,1,1
700,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,7.2250,0,0

In [50]:
df['age']<=18

0      False
1      False
2      False
3      False
4      False
       ...
709    False
710    False
711    False
712    False
713    False
Name: age, Length: 714, dtype: bool

In [51]:
df[ (df['survived']==1) & (df['age']<=18)]

,survived,pclass,name,sex,age,fare,sibsp,parch
8,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,30.0708,1,0
9,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,16.7000,1,1
19,1,3,"McGowan, Miss. Anna ""Annie""",female,15.00,8.0292,0,0
30,1,3,"Nicola-Yarred, Miss. Jamila",female,14.00,11.2417,1,0
33,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,41.5792,1,2
...,...,...,...,...,...,...,...,...
664,1,2,"Richards, Master. George Sibley",male,0.83,18.7500,1,1
681,1,1,"Lines, Miss. Mary Conover",female,16.00,39.4000,0,1
683,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.00,9.3500,0,1
694,1,3,"Johnson, Master. Harold Theodor",male,4.00,11.1333,1,1
700,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.00,7.2250,0,0

In [52]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0
...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0

In [56]:
df['new_col_sudh'] = df['age'] *2

In [57]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch,new_col_sudh
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0,44.0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0,76.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0,52.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0,70.0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0,70.0
...,...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5,78.0
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0,54.0
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0,38.0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0,52.0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0,64.0

In [61]:
df['new_col']=None

In [62]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch,new_col_sudh,new_col
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0,44.0,None
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0,76.0,None
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0,52.0,None
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0,70.0,None
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0,70.0,None
...,...,...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5,78.0,None
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0,54.0,None
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0,38.0,None
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0,52.0,None
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0,64.0,None

In [63]:
df.to_csv('titanic_new1.csv', index=False)

In [66]:
df.sort_values(by='age', ascending=False)

,survived,pclass,name,sex,age,fare,sibsp,parch,new_col_sudh,new_col
498,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,30.0000,0,0,160.00,None
679,0,3,"Svensson, Mr. Johan",male,74.00,7.7750,0,0,148.00,None
393,0,1,"Artagaveytia, Mr. Ramon",male,71.00,49.5042,0,0,142.00,None
74,0,1,"Goldschmidt, Mr. George B",male,71.00,34.6542,0,0,142.00,None
91,0,3,"Connors, Mr. Patrick",male,70.50,7.7500,0,0,141.00,None
...,...,...,...,...,...,...,...,...,...,...
59,1,2,"Caldwell, Master. Alden Gates",male,0.83,29.0000,0,2,1.66,None
509,1,3,"Baclini, Miss. Eugenie",female,0.75,19.2583,2,1,1.50,None
374,1,3,"Baclini, Miss. Helene Barbara",female,0.75,19.2583,2,1,1.50,None
602,1,2,"Hamalainen, Master. Viljo",male,0.67,14.5000,1,1,1.34,None
640,1,3,"Thomas, Master. Assad Alexander",male,0.42,8.5167,0,1,0.84,None

In [68]:
df['sex'].value_counts()

sex
male      453
female    261
Name: count, dtype: int64

In [70]:
df['survived'].value_counts()

survived
0    424
1    290
Name: count, dtype: int64

In [72]:
df = pd.read_csv('StudentsPerformance.csv')

In [73]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [74]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [77]:
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [79]:
df.shape

(1000, 8)

In [80]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [81]:
df.index

RangeIndex(start=0, stop=1000, step=1)

In [82]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [84]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [85]:
df.describe(include='object')

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,518,319,226,645,642

In [86]:
df.describe(include='all')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1000,1000,1000,1000,1000,1000.00000,1000.000000,1000.000000
unique,2,5,6,2,2,NaN,NaN,NaN
top,female,group C,some college,standard,none,NaN,NaN,NaN
freq,518,319,226,645,642,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,66.08900,69.169000,68.054000
std,NaN,NaN,NaN,NaN,NaN,15.16308,14.600192,15.195657
min,NaN,NaN,NaN,NaN,NaN,0.00000,17.000000,10.000000
25%,NaN,NaN,NaN,NaN,NaN,57.00000,59.000000,57.750000
50%,NaN,NaN,NaN,NaN,NaN,66.00000,70.000000,69.000000
75%,NaN,NaN,NaN,NaN,NaN,77.00000,79.000000,79.000000
max,NaN,NaN,NaN,NaN,NaN,100.00000,100.000000,100.000000

In [87]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [88]:
df.describe(include="object")

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,518,319,226,645,642

In [89]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [90]:
df.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [92]:
df['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [93]:
type(df['gender'])

pandas.core.series.Series

In [97]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [100]:
df.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [105]:
df[(df['gender']=='female') & (df['math score']>80) ]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
2,female,group B,master's degree,standard,none,90,95,93
6,female,group B,some college,standard,completed,88,95,92
56,female,group E,associate's degree,standard,completed,82,85,86
102,female,group D,associate's degree,standard,none,85,91,89
106,female,group D,master's degree,standard,none,87,100,100
...,...,...,...,...,...,...,...,...
957,female,group D,master's degree,standard,none,92,100,100
962,female,group E,associate's degree,standard,none,100,100,100
970,female,group D,bachelor's degree,standard,none,89,100,100
979,female,group C,associate's degree,standard,none,91,95,94
995,female,group E,master's degree,standard,completed,88,99,95

In [108]:
(df['gender']=='female') & (df['math score']>80)

0      False
1      False
2       True
3      False
4      False
       ...
995     True
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [111]:
df[(df['race/ethnicity']=="group A") | (df['race/ethnicity']=="group B")]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
983,female,group A,some college,standard,completed,78,87,91
985,male,group A,high school,standard,none,57,51,54
988,female,group A,some high school,free/reduced,none,44,45,45
991,female,group B,some high school,standard,completed,65,82,78
994,male,group A,high school,standard,none,63,63,62

In [110]:
df[(df['race/ethnicity'].isin(['group A','group B']))]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
983,female,group A,some college,standard,completed,78,87,91
985,male,group A,high school,standard,none,57,51,54
988,female,group A,some high school,free/reduced,none,44,45,45
991,female,group B,some high school,standard,completed,65,82,78
994,male,group A,high school,standard,none,63,63,62

In [113]:
df[(df['math score']>90) & (df['math score']<=100) ]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
34,male,group E,some college,standard,none,97,87,82
104,male,group C,some college,standard,completed,98,86,90
114,female,group E,bachelor's degree,standard,completed,99,100,100
121,male,group B,associate's degree,standard,completed,91,89,92
149,male,group E,associate's degree,free/reduced,completed,100,100,93
165,female,group C,bachelor's degree,standard,completed,96,100,100
171,male,group E,some high school,standard,none,94,88,78
179,female,group D,some high school,standard,completed,97,100,100
233,male,group E,some high school,standard,none,92,87,78
263,female,group E,high school,standard,none,99,93,90
286,male,group E,associate's degree,standard,completed,97,82,88
306,male,group E,some college,standard,completed,99,87,81
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
469,male,group C,some college,standard,none,91,74,76
501,female,group B,associate's degree,standard,completed,94,87,92
503,female,group E,associate's degree,standard,completed,95,89,92
521,female,group C,associate's degree,standard,none,91,86,84
539,male,group A,associate's degree,standard,completed,97,92,86
546,female,group A,some high school,standard,completed,92,100,97
562,male,group C,bachelor's degree,standard,completed,96,90,92
566,female,group E,bachelor's degree,free/reduced,completed,92,100,100
571,male,group A,bachelor's degree,standard,none,91,96,92
594,female,group C,bachelor's degree,standard,completed,92,100,99
612,male,group C,bachelor's degree,standard,completed,94,90,91
618,male,group D,master's degree,standard,none,95,81,84
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
685,female,group E,master's degree,standard,completed,94,99,100
689,male,group E,some college,free/reduced,none,93,90,83
710,male,group C,some college,standard,completed,93,84,90
712,female,group D,some college,standard,none,98,100,99
717,female,group C,associate's degree,standard,completed,96,96,99
719,male,group E,associate's degree,free/reduced,completed,91,73,80
736,male,group C,associate's degree,standard,none,92,79,84
779,male,group E,associate's degree,standard,completed,94,85,82
784,male,group C,bachelor's degree,standard,completed,91,81,79
815,male,group B,some high school,standard,completed,94,86,87
846,male,group C,master's degree,standard,completed,91,85,85
855,female,group B,bachelor's degree,standard,none,97,97,96
864,male,group C,associate's degree,standard,none,97,93,91
886,female,group E,associate's degree,standard,completed,93,100,95
903,female,group D,bachelor's degree,free/reduced,completed,93,100,100
916,male,group E,bachelor's degree,standard,completed,100,100,100
919,male,group B,some college,standard,completed,91,96,91
934,male,group C,associate's degree,standard,completed,98,87,90
950,male,group E,high school,standard,none,94,73,71
957,female,group D,master's degree,standard,none,92,100,100
962,female,group E,associate's degree,standard,none,100,100,100
979,female,group C,associate's degree,standard,none,91,95,94

In [115]:
df[ 90<(df['math score'])<=100 ]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [117]:
df['math score'].between(90,100)

0      False
1      False
2       True
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: math score, Length: 1000, dtype: bool

In [118]:
df[df['math score'].between(90,100)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
2,female,group B,master's degree,standard,none,90,95,93
34,male,group E,some college,standard,none,97,87,82
104,male,group C,some college,standard,completed,98,86,90
114,female,group E,bachelor's degree,standard,completed,99,100,100
121,male,group B,associate's degree,standard,completed,91,89,92
149,male,group E,associate's degree,free/reduced,completed,100,100,93
165,female,group C,bachelor's degree,standard,completed,96,100,100
171,male,group E,some high school,standard,none,94,88,78
179,female,group D,some high school,standard,completed,97,100,100
233,male,group E,some high school,standard,none,92,87,78
263,female,group E,high school,standard,none,99,93,90
286,male,group E,associate's degree,standard,completed,97,82,88
299,male,group D,associate's degree,free/reduced,none,90,87,75
306,male,group E,some college,standard,completed,99,87,81
333,male,group B,associate's degree,standard,none,90,78,81
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
469,male,group C,some college,standard,none,91,74,76
474,female,group B,associate's degree,standard,completed,90,90,91
501,female,group B,associate's degree,standard,completed,94,87,92
503,female,group E,associate's degree,standard,completed,95,89,92
521,female,group C,associate's degree,standard,none,91,86,84
539,male,group A,associate's degree,standard,completed,97,92,86
546,female,group A,some high school,standard,completed,92,100,97
562,male,group C,bachelor's degree,standard,completed,96,90,92
566,female,group E,bachelor's degree,free/reduced,completed,92,100,100
571,male,group A,bachelor's degree,standard,none,91,96,92
594,female,group C,bachelor's degree,standard,completed,92,100,99
612,male,group C,bachelor's degree,standard,completed,94,90,91
618,male,group D,master's degree,standard,none,95,81,84
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
659,male,group D,associate's degree,standard,none,90,87,85
685,female,group E,master's degree,standard,completed,94,99,100
689,male,group E,some college,free/reduced,none,93,90,83
710,male,group C,some college,standard,completed,93,84,90
712,female,group D,some college,standard,none,98,100,99
717,female,group C,associate's degree,standard,completed,96,96,99
719,male,group E,associate's degree,free/reduced,completed,91,73,80
736,male,group C,associate's degree,standard,none,92,79,84
779,male,group E,associate's degree,standard,completed,94,85,82
784,male,group C,bachelor's degree,standard,completed,91,81,79
808,male,group C,high school,standard,none,90,75,69
815,male,group B,some high school,standard,completed,94,86,87
845,male,group E,master's degree,standard,none,90,85,84
846,male,group C,master's degree,standard,completed,91,85,85
855,female,group B,bachelor's degree,standard,none,97,97,96
864,male,group C,associate's degree,standard,none,97,93,91
873,male,group E,associate's degree,free/reduced,none,90,90,82
886,female,group E,associate's degree,standard,completed,93,100,95
903,female,group D,bachelor's degree,free/reduced,completed,93,100,100
916,male,group E,bachelor's degree,standard,completed,100,100,100
919,male,group B,some college,standard,completed,91,96,91
934,male,group C,associate's degree,standard,completed,98,87,90
950,male,group E,high school,standard,none,94,73,71
957,female,group D,master's degree,standard,none,92,100,100
962,female,group E,associate's degree,standard,none,100,100,100
979,female,group C,associate's degree,standard,none,91,95,94

In [120]:
#loc and iloc

df.loc[0:5, ['gender', 'math score', 'lunch']]

   gender  math score         lunch
0  female          72      standard
1  female          69      standard
2  female          90      standard
3    male          47  free/reduced
4    male          76      standard
5  female          71      standard

In [124]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [132]:
df.iloc[0:5,[7]]

   writing score
0             74
1             88
2             93
3             44
4             75

In [133]:
#location is work on actual and name based column name or array

#iloc  is work on range based or we have to provide index position

In [134]:
df.loc[0:4, ['race/ethnicity', 'lunch']]

  race/ethnicity         lunch
0        group B      standard
1        group C      standard
2        group B      standard
3        group A  free/reduced
4        group C      standard

In [136]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [142]:
def math_performance(score):
    if score['math score']>90:
        return 'excellent'
    elif score['math score']>75:
        return 'good'
    else:
        return 'average'
    
df['math_performance'] = df.apply(math_performance, axis=1)

In [143]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_performance
0,female,group B,bachelor's degree,standard,none,72,72,74,average
1,female,group C,some college,standard,completed,69,90,88,average
2,female,group B,master's degree,standard,none,90,95,93,good
3,male,group A,associate's degree,free/reduced,none,47,57,44,average
4,male,group C,some college,standard,none,76,78,75,good
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,good
996,male,group C,high school,free/reduced,none,62,55,55,average
997,female,group C,high school,free/reduced,completed,59,71,65,average
998,female,group D,some college,standard,completed,68,78,77,average
999,female,group D,some college,free/reduced,none,77,86,86,good

In [147]:
def newCol(score):
    return score['race/ethnicity'].replace("group", "")

df['newCol1'] = df.apply(newCol, axis=1)
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_performance,newCol,newCol1
0,female,group B,bachelor's degree,standard,none,72,72,74,average,B,B
1,female,group C,some college,standard,completed,69,90,88,average,C,C
2,female,group B,master's degree,standard,none,90,95,93,good,B,B
3,male,group A,associate's degree,free/reduced,none,47,57,44,average,A,A
4,male,group C,some college,standard,none,76,78,75,good,C,C

In [148]:
df['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [151]:
df['gender_num']=df['gender'].map({"female":1, "male":0})

In [152]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_performance,newCol,newCol1,gender_num
0,female,group B,bachelor's degree,standard,none,72,72,74,average,B,B,1
1,female,group C,some college,standard,completed,69,90,88,average,C,C,1
2,female,group B,master's degree,standard,none,90,95,93,good,B,B,1
3,male,group A,associate's degree,free/reduced,none,47,57,44,average,A,A,0
4,male,group C,some college,standard,none,76,78,75,good,C,C,0

In [153]:
df['race/ethnicity'].map({"group A":"A", "group B":"B", "group C":"C", "group D":"D", "group E":"E"})

0      B
1      C
2      B
3      A
4      C
      ..
995    E
996    C
997    C
998    D
999    D
Name: race/ethnicity, Length: 1000, dtype: object

In [154]:
df['gender'].unique()

array(['female', 'male'], dtype=object)

In [157]:
df['gender'].nunique()

2

In [159]:
df.sort_values(by='math score', ascending=True)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_performance,newCol,newCol1,gender_num
59,female,group C,some high school,free/reduced,none,0,17,10,average,C,C,1
980,female,group B,high school,free/reduced,none,8,24,23,average,B,B,1
17,female,group B,some high school,free/reduced,none,18,32,28,average,B,B,1
787,female,group B,some college,standard,none,19,38,32,average,B,B,1
145,female,group C,some college,free/reduced,none,22,39,33,average,C,C,1
...,...,...,...,...,...,...,...,...,...,...,...,...
962,female,group E,associate's degree,standard,none,100,100,100,excellent,E,E,1
625,male,group D,some college,standard,completed,100,97,99,excellent,D,D,0
916,male,group E,bachelor's degree,standard,completed,100,100,100,excellent,E,E,0
458,female,group E,bachelor's degree,standard,none,100,100,100,excellent,E,E,1
451,female,group E,some college,standard,none,100,92,97,excellent,E,E,1

In [166]:
df.groupby('gender')['math score'].mean()

gender
female    63.633205
male      68.728216
Name: math score, dtype: float64

In [167]:
pd.pivot_table(df,values='math score', index='gender', columns='lunch', aggfunc='mean')

lunch   free/reduced   standard
gender
female     55.814815  68.124620
male       62.457831  72.022152

In [168]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score', 'math_performance', 'newCol', 'newCol1', 'gender_num'],
      dtype='object')

In [169]:
df.drop(columns=["newCol1"])

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_performance,newCol,gender_num
0,female,group B,bachelor's degree,standard,none,72,72,74,average,B,1
1,female,group C,some college,standard,completed,69,90,88,average,C,1
2,female,group B,master's degree,standard,none,90,95,93,good,B,1
3,male,group A,associate's degree,free/reduced,none,47,57,44,average,A,0
4,male,group C,some college,standard,none,76,78,75,good,C,0
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,good,E,1
996,male,group C,high school,free/reduced,none,62,55,55,average,C,0
997,female,group C,high school,free/reduced,completed,59,71,65,average,C,1
998,female,group D,some college,standard,completed,68,78,77,average,D,1
999,female,group D,some college,free/reduced,none,77,86,86,good,D,1

In [170]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_performance,newCol,newCol1,gender_num
0,female,group B,bachelor's degree,standard,none,72,72,74,average,B,B,1
1,female,group C,some college,standard,completed,69,90,88,average,C,C,1
2,female,group B,master's degree,standard,none,90,95,93,good,B,B,1
3,male,group A,associate's degree,free/reduced,none,47,57,44,average,A,A,0
4,male,group C,some college,standard,none,76,78,75,good,C,C,0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,good,E,E,1
996,male,group C,high school,free/reduced,none,62,55,55,average,C,C,0
997,female,group C,high school,free/reduced,completed,59,71,65,average,C,C,1
998,female,group D,some college,standard,completed,68,78,77,average,D,D,1
999,female,group D,some college,free/reduced,none,77,86,86,good,D,D,1

In [171]:
df.drop(columns=['newCol1'], inplace=True)
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_performance,newCol,gender_num
0,female,group B,bachelor's degree,standard,none,72,72,74,average,B,1
1,female,group C,some college,standard,completed,69,90,88,average,C,1
2,female,group B,master's degree,standard,none,90,95,93,good,B,1
3,male,group A,associate's degree,free/reduced,none,47,57,44,average,A,0
4,male,group C,some college,standard,none,76,78,75,good,C,0
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,good,E,1
996,male,group C,high school,free/reduced,none,62,55,55,average,C,0
997,female,group C,high school,free/reduced,completed,59,71,65,average,C,1
998,female,group D,some college,standard,completed,68,78,77,average,D,1
999,female,group D,some college,free/reduced,none,77,86,86,good,D,1

In [178]:
df['math score'].dtype

dtype('int64')

In [176]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,math_performance,newCol,gender_num
0,female,group B,bachelor's degree,standard,none,72,72,74,average,B,1
1,female,group C,some college,standard,completed,69,90,88,average,C,1
2,female,group B,master's degree,standard,none,90,95,93,good,B,1
3,male,group A,associate's degree,free/reduced,none,47,57,44,average,A,0
4,male,group C,some college,standard,none,76,78,75,good,C,0

In [179]:
df['math score'].astype('float64')

0      72.0
1      69.0
2      90.0
3      47.0
4      76.0
       ...
995    88.0
996    62.0
997    59.0
998    68.0
999    77.0
Name: math score, Length: 1000, dtype: float64